[
    {
        "roses":[
            {
                "shrubs":[
                    {
                        "price":22.99,
                        "descriptions":"Очаровательная белоснежная роза с бутоном классической формы.",
                        "image":"Splozina",
                        "name":"Splozina",
                        "id":1,
                        "isSelected":false
                    },
                    {
                        "price":22.99,
                        "descriptions":"Если вдруг что-то в ваших отношениях пошло не так или, наоборот, Вы поняли сегодня самое важное - вспомните про этот красивый цветок... Он будет очень кстати.",
                        "image":"ForGood",
                        "name":"For Good",
                        "id":2,
                        "isSelected":false
                    },
                    {
                        "price":22.99,
                        "descriptions":"Белая, с кремовым оттенком, роза. Имеет бутон классической формы и аромат, напоминающий ваниль.",
                        "image":"Porcellino",
                        "name":"Porcellino",
                        "id":3,
                        "isSelected":false
                    },
                    {
                        "price":22.99,
                        "descriptions":" «Магическая» двухцветная кустовая роза родом из Нидерландов.",
                        "image":"DutchMagi",
                        "name":"Dutch Magi",
                        "id":4,
                        "isSelected":false
                    },
                    {
                        "price":22.99,
                        "descriptions":"Чайно-гибридная роза с королевским цветком, который имеет от 40 лепестков, расположенных концентрическими кругами. Лепестки кремово-белые, с розовым краем.",
                        "image":"Аthena",
                        "name":"Аthena",
                        "id":5,
                        "isSelected":false
                    },
                    {
                        "price":22.99,
                        "descriptions":"Роза необычайно мягких тонов. Нежный, кремово-белый окрас перетекает в мягко-розовый, придавая розе выразительность.",
                        "image":"Reflex",
                        "name":"Reflex",
                        "id":6,
                        "isSelected":false
                    },
                    {
                        "price":22.99,
                        "descriptions":"Бутон классической бокаловидной формы, нежные бело-розовые лепестки, сладковатый аромат средней интенсивности. Отличный подарок любимым без повода.",
                        "image":"Jumilia",
                        "name":"Jumilia",
                        "id":7,
                        "isSelected":false
                    },
                    {
                        "price":22.99,
                        "descriptions":"Пионовидная кустовая Роза из Нидерландов. Плотные бутоны шаровидной формы, окрашенные в кремовый цвет, прекрасно смотрятся на небольшом стройном стебле.",
                        "image":"Bombastic",
                        "name":"Bombastic",
                        "id":8,
                        "isSelected":false
                    },
                    
                    {
                        "price":22.99,
                        "descriptions":"Некрупная кустовая роза нежного розового цвета.",
                        "image":"Irischkapink",
                        "name":"Irischka pink",
                        "id":9,
                        "isSelected":false
                    },
                    
                    {
                        "price":22.99,
                        "descriptions":"Кустовая пионовидная роза с двухцветными бутонами насыщенного розово-малинового цвета",
                        "image":"LadyBombastic",
                        "name":"Lady Bombastic",
                        "id":10,
                        "isSelected":false
                    },
                    
                    {
                        "price":22.99,
                        "descriptions":"Пионовидная бордовая роза. Шаровидный плотный бутон с множеством лепестков, как у старинных садовых роз.",
                        "image":"PianoRed",
                        "name":"Piano Red",
                        "id":11,
                        "isSelected":false
                    },
                    
                    {
                        "price":22.99,
                        "descriptions":"Тёмно-красная  кустовая роза небольшого размера. Бутоны чашевидной формы с бархатистыми лепестками.",
                        "image":"RedLex",
                        "name":"Red Lex",
                        "id":12,
                        "isSelected":false
                    },
                    
                    {
                        "price":22.99,
                        "descriptions":" «Голландская сенсация». Ярко-красная роза, которая стала сенсацией даже в самой цветочной стране - Голландии.",
                        "image":"DutchSensation",
                        "name":"Dutch Sensation",
                        "id":13,
                        "isSelected":false
                    },
                    
                    {
                        "price":22.99,
                        "descriptions":"Бутоны традиционной формы перламутрово-розового цвета, с салатовой «рубашкой» ",
                        "image":"MansfieldPark",
                        "name":"Mansfield Park",
                        "id":14,
                        "isSelected":false
                    },
                    
                    {
                        "price":22.99,
                        "descriptions":"Классическая английская форма бутона. Это цветок из сортсерии «законодательница моды» красно-розового цвета ",
                        "image":"JollyTrendsetter",
                        "name":"Jolly Trendsetter",
                        "id":15,
                        "isSelected":false
                    },
                    
                    {
                        "price":22.99,
                        "descriptions":"Классическая английская форма бутона. Это цветок из сортсерии «законодательница моды» ярко-жёлтого, солнечного цвета ",
                        "image":"LunaTrendsetter",
                        "name":"Luna Trendsetter",
                        "id":16,
                        "isSelected":false
                    },
                    
                    {
                        "price":22.99,
                        "descriptions":"Крайне необычный вариант кустовой розы, который скорее подходит для аранжировки. ",
                        "image":"BottelCorallogreen",
                        "name":"Bottel Corallo green",
                        "id":17,
                        "isSelected":false
                    },
                    
                    {
                        "price":22.99,
                        "descriptions":"Мягкий, приятный розово-зелёный оттенок, большое количество бутонов на цветке, изысканно закрученные лепестки",
                        "image":"SweetFlow",
                        "name":"Sweet Flow",
                        "id":18,
                        "isSelected":false
                    },
                    
                    {
                        "price":22.99,
                        "descriptions":"Классическая английская форма бутона. Это цветок из сортсерии «законодательница моды» красно-фиолетового, рубинового цвета ",
                        "image":"PartyTrendsetter",
                        "name":"Party Trendsetter",
                        "id":19,
                        "isSelected":false
                    },
                    
                    {
                        "price":22.99,
                        "descriptions":"Кустовая пионовидная роза, ярко желтого, солнечного цвета",
                        "image":"Catalina",
                        "name":"Catalina",
                        "id":20,
                        "isSelected":false
                    },
                    
                    {
                        "price":22.99,
                        "descriptions":"Кустовая пионовидная роза. Крупный плотный шаровидный бутон; лепестки бело-зелёного цвета с малиновым краем. Выглядит оригинально и необычно; находка для любителей стиля «винтаж» ",
                        "image":"LatinPompon",
                        "name":"Latin Pompon",
                        "id":21,
                        "isSelected":false
                    },
                    
                    {
                        "price":22.99,
                        "descriptions":"Очень крупная кустовая роза розово-лососевого оттенка",
                        "image":"BigSuccess",
                        "name":"Big Success",
                        "id":22,
                        "isSelected":false
                    },
                    
                    {
                        "price":22.99,
                        "descriptions":"Святая София - кустовая роза с очень крупными бутонами кораллово-розового цвета. По внешнему виду, эффектности и размеру уверенно конкурирует с одноголовыми розами.",
                        "image":"AyaSofia",
                        "name":"Aya Sofia",
                        "id":23,
                        "isSelected":false
                    },
                    
                    {
                        "price":22.99,
                        "descriptions":"Смешение тёплого, светло-розового и холодного, бледно-сиреневого оттенков действительно создаёт впечатление лёгкого, полупрозрачного серебристого налёта. Красиво, утончённо, небанально.",
                        "image":"SilverLace",
                        "name":"Silver Lace",
                        "id":24,
                        "isSelected":false
                    },
                    
                    {
                        "price":22.99,
                        "descriptions":"очаровательная миниатюрная розочка. Бутончик классической формы, как у 'взрослых' сестёр; цвет также вполне классический. Однако россыпь этих маленьких красавиц способна создать такое настроение, которое классическим розам будет не под силу.",
                        "image":"PinkBubbles",
                        "name":"Pink Bubbles",
                        "id":25,
                        "isSelected":false
                    },
                    
                    {
                        "price":22.99,
                        "descriptions":"Тёмно-бордовая кустовая роза. Очень эффектная, 'торжественная', или 'вечерняя'. Миниатюрность только добавляет ей изысканности и очарования. Отличный вариант, чтобы выразить вполне определённые чувства и при этом оказаться оригинальным.",
                        "image":"Angelique",
                        "name":"Angelique",
                        "id":26,
                        "isSelected":false
                    },
                    
                    {
                        "price":22.99,
                        "descriptions":"Романтические пузырьки — просто невероятно милые розочки. Они настолько миниатюрны, что кажутся детскими, игрушечными; хочется взять их большую охапку и 'утопить' в них любимого человека",
                        "image":"RomanticBubbles",
                        "name":"Romantic Bubbles",
                        "id":27,
                        "isSelected":false
                    },
                    
                    {
                        "price":22.99,
                        "descriptions":"('Малайское украшение') - кремово-розовая кустовая роза из премиального сегмента. Нежный спокойный тон, идеальные бутончики - как нечто умиротворяющее из далёкой, омываемой тёплыми морями Малайи.",
                        "image":"MalayaBijoux",
                        "name":"Malaya Bijoux",
                        "id":28,
                        "isSelected":false
                    },
                    
                    {
                        "price":22.99,
                        "descriptions":"Роза, относящаяся к классу 'премиум', что неудивительно: лепестки насыщенного розового (малинового) цвета не дают в этом усомниться, буквально завораживая взгляд.",
                        "image":"Quincy",
                        "name":"Quincy",
                        "id":29,
                        "isSelected":false
                    },
                    {
                        "price":22.99,
                        "descriptions":"Роза класса 'премиум', с чем не поспоришь - классической формы бутоны тёмно-бордового, близкого к чёрному, цвета, выглядят просто роскошно. Это не романтическая влюблённость, это страсть, поглотившая полностью",
                        "image":"Amata",
                        "name":"Amata",
                        "id":30,
                        "isSelected":false
                    },
                    
                    {
                        "price":22.99,
                        "descriptions":"Маленькая, но буквально полыхающая оранжево-жёлтым пламенем розочка. ",
                        "image":"Eyeliner",
                        "name":"Eyeliner",
                        "id":31,
                        "isSelected":false
                    },
                    
                    {
                        "price":22.99,
                        "descriptions":"Двухцветная кустовая роза. Цвет меняется от бледного-розового к красно-оранжевому. Бутон плотный, классической формы.",
                        "image":"Zadique",
                        "name":"Zadique",
                        "id":32,
                        "isSelected":false
                    },
                    
                    {
                        "price":22.99,
                        "descriptions":" «Рубиновое украшение» - кустовая пионовидная роза насыщенного, рубинового оттенка, как ублагородного вина.",
                        "image":"RubyBijoux",
                        "name":"Ruby Bijoux",
                        "id":33,
                        "isSelected":false
                    },
                    
                    {
                        "price":22.99,
                        "descriptions":" При взгляде на эту розу возникает ощущение, что это именно такой цветок, каким должна быть классическая роза. Бутон классической формы, классический тёмно-розовый цвет, унаследованный от шиповника.",
                        "image":"ClassicSensation",
                        "name":"Classic Sensation",
                        "id":34,
                        "isSelected":false
                    },
                    {
                        "price":22.99,
                        "descriptions":"Цвет - персиково-розовый или, как пишет поставщик, цвет 'брызги шампанского'. Маленькие бутончики действительно напоминают веер брызг, что и дало название всем кустовым розам в принципе. Тем более, что там, где розы - там и шампанское и, возможно, секрет хорошего вечера - в этой розе",
                        "image":"Justine",
                        "name":"Justine",
                        "id":35,
                        "isSelected":false
                    },
                    {
                        "price":22.99,
                        "descriptions":"Очень выразительная кустовая роза. Лепестки имеют светло-розовый окрас снаружи и тёмно-бордовый на внутренней части. В отличие от большинства других двухцветных роз, которым это добавляет современности, двухцветный окрас идеальных бутончиков традиционной формы только усиливает впечатление 'классики'. Эффектность в классическом стиле — для кого-то это может стать просто идеальным подарком.",
                        "image":"BBubbles",
                        "name":"B-Bubbles",
                        "id":36,
                        "isSelected":false
                    },
                    
                    {
                        "price":22.99,
                        "descriptions":"Кустовая роза из разряда 'премиум'. Цвет мягкий, спокойный и довольно неожиданный для розы — розовый с оттенком фиолетового, называемый ещё лавандовым или аметистовым.",
                        "image":"ALady",
                        "name":"A-Lady",
                        "id":37,
                        "isSelected":false
                    },
                    
                    {
                        "price":22.99,
                        "descriptions":"Бело-розовая пионовидная кустовая роза. Замечательно, 'картинно' смотрится в монобукете; прекрасно дополняет составные букеты, не уходя при этом на второй план.",
                        "image":"PorcelinaLace",
                        "name":"Porcelina Lace",
                        "id":38,
                        "isSelected":false
                    },
                    
                    {
                        "price":22.99,
                        "descriptions":"Кустовая ярко-оранжевая роза. Чрезвычайно позитивный оттенок, две-три веточки этих замечательных 'коралловых пузырьков' — и хорошее настроение обеспечено.",
                        "image":"CoralBubbles",
                        "name":"Coral Bubbles",
                        "id":39,
                        "isSelected":false
                    },
                    
                    {
                        "price":22.99,
                        "descriptions":"Кустовая роза белового цвета с желтовато-кремовой серединкой. Очень популярна для составления свадебных букетов; прекрасно сочетается с другими цветами и очень достойно выглядит в монобукете.",
                        "image":"WhiteBubbles",
                        "name":"White Bubbles",
                        "id":40,
                        "isSelected":false
                    },
                    
                    {
                        "price":22.99,
                        "descriptions":"Кустовая роза 'Аэробик' замечательна и формой, и цветом, а её миниатюрность только добавляет ей очарования. Просто находка для любителей нежности.",
                        "image":"Aerobic",
                        "name":"Aerobic",
                        "id":41,
                        "isSelected":false
                    },
                    {
                        "price":22.99,
                        "descriptions":"Популярная двухцветная роза. Маленькие жёлто-красные бутончики, словно танцуя, играют переливами цвета от тёплого к жаркому",
                        "image":"SummerDance",
                        "name":"Summer Dance",
                        "id":42,
                        "isSelected":false
                    },
                    {
                        "price":22.99,
                        "descriptions":"Ванильное кружево —     бело-кремовая, как цветок ванили, кустовая роза. А многочисленные маленькие пионовидные бутончики с туго скрученными лепестками - это и есть то самое ароматное кружево, от которого не откажется ни одна женщина",
                        "image":"VanillaLace",
                        "name":"Vanilla Lace",
                        "id":43,
                        "isSelected":false
                    },
                    {
                        "price":22.99,
                        "descriptions":"Плотные маленькие бутоны, напоминающие бубенчики, неоднородны по окрасу - от светлого до тёмно-розового в зелёной рубашке. Эти непредсказуемые, можно сказать, хаотичные переливы цвета на 'капустных' завикрениях лепестков создают видимость некоего кружева. Ну а то, что кружево розовое, только добавляет пикантности этому неординарному цветку.",
                        "image":"PinkLace",
                        "name":"Pink Lace",
                        "id":44,
                        "isSelected":false
                    },
                    {
                        "price":22.99,
                        "descriptions":"Кто скрывается под псевдонимом ДжоДжо - персонаж популярного японского комикса, знаменитый музыкант Джоджо Майер или кто-то ещё прекрасный или прекрасная — создатели этой розы не объяснили. Но то, что эта роза получилась прекрасной — сомнений нет. Солнечный оттенок, плотный бутон - россыпь этих золотистых капель дышит летом, счастьем и безмятежностью.",
                        "image":"LovelyJoJo",
                        "name":"Lovely JoJo",
                        "id":45,
                        "isSelected":false
                    },
                    {
                        "price":22.99,
                        "descriptions":"Замечательная роза с русским именем. Нежнейший персиковый оттенок, бархатистые, вьющиеся, как бы угловатые лепестки делают эту миниатюрную розочку утончённо- элегантной.",
                        "image":"Tanja",
                        "name":"Tanja",
                        "id":46,
                        "isSelected":false
                    },
                    {
                        "price":22.99,
                        "descriptions":"Бело-розовая многоголовая роза. 'Звёздная' россыпь из маленьких бутончиков выглядит очень приятно и ненавязчиво.",
                        "image":"SweetStars",
                        "name":"Sweet Stars",
                        "id":47,
                        "isSelected":false
                    },
                    {
                        "price":22.99,
                        "descriptions":"Кремовые лепестки и розоватая сердцевинка придают этой розе очень нежный и очень изящный вид.",
                        "image":"RoyalPorcellina",
                        "name":"Royal Porcellina",
                        "id":48,
                        "isSelected":false
                    },
                    {
                        "price":22.99,
                        "descriptions":"Бело-кремовая кустовая роза 'Галина'. Приятный аромат и классическая, 'винтажная' форма делают её хорошим подарком в любое время года и по любому поводу.",
                        "image":"Galina",
                        "name":"Galina",
                        "id":49,
                        "isSelected":false
                    },
                    {
                        "price":22.99,
                        "descriptions":"Одно название этой розы уже способно привлечь к ней внимание. И ненапрасно. Интересен её пионовидный бутон, интересны лепестки в этих бутонах с как бы нарочито небрежными, слегка 'мятыми' краями. Интересен, конечно же, её цвет - розово- фиолетовый, 'лавандовый'. Не классика, не стандарт, не обывательская усреднённость. Очень соответствует модному ныне словечку 'дерзкая'. Одним словом, если ищете для подарка нечто оригинальное - то вот оно, перед Вами.",
                        "image":"LavenderLace",
                        "name":"Lavender Lace",
                        "id":50,
                        "isSelected":false
                    },
                    {
                        "price":22.99,
                        "descriptions":"Кустовая роза очень тёплого розово-белого, или кремового, оттенка. Небольшие бутончики имеют очень лёгкий аромат и растут очень густо.",
                        "image":"Jana",
                        "name":"Jana",
                        "id":51,
                        "isSelected":false
                    },
                    {
                        "price":22.99,
                        "descriptions":"Популярная кустовая роза нежного бело-кремового цвета. Длина стебля 40-45 см. Жыве Беларусь!",
                        "image":"Belarus",
                        "name":"Belarus",
                        "id":52,
                        "isSelected":false
                    },
                    {
                        "price":22.99,
                        "descriptions":"Роза огненно-оранжевого цвета с классической формы бутонами небольшого размера. Действительно, необычайно эффектная роза.",
                        "image":"OrangeSensation",
                        "name":"Orange Sensation",
                        "id":53,
                        "isSelected":false
                    },
                    {
                        "price":22.99,
                        "descriptions":"Яркая, эффектная двухцветная роза. Цвет лепестков в бутоне меняется от яркоранжевого у основания к красному по краям лепестков.",
                        "image":"FiestaBubbles",
                        "name":"Fiesta Bubbles",
                        "id":54,
                        "isSelected":false
                    },
                    {
                        "price":22.99,
                        "descriptions":"Голландская кустовая роза. Небольшой размер, очень милые, 'солнцеподобные', бутончики золотисто-жёлтого цвета. Воплощение оптимизма и позитива.",
                        "image":"DutchDakar",
                        "name":"Dutch Dakar",
                        "id":55,
                        "isSelected":false
                    },
                    {
                        "price":22.99,
                        "descriptions":"Яркая, эффектная двухцветная роза. Сочетание нежно жёлтой рубашки и жгуче-красного цвета ближе к сердцевине.",
                        "image":"sprayMisMac",
                        "name":"Mis Mac",
                        "id":56,
                        "isSelected":false
                    },
                    {
                        "price":10.99,
                        "descriptions":"Замечательная кустовая роза. Белая, как свадебное платье и изящная, как невеста.",
                        "image":"WhiteLady",
                        "name":"White Lady",
                        "id":57,
                        "isSelected":false
                    }
                ],
                "singleheadedRose":[
                    {
                        "rosesFrost":[               {
                            "price":10.99,
                            "descriptions":"Замечательная кустовая роза. Белая, как свадебное платье и изящная, как невеста.",
                            "image":"WhiteLady",
                            "name":"White Lady",
                            "id":57,
                            "isSelected":false
                        }]
                        
                    }
                ]
                
            }
        ]
        
    }
]
